In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20230101', periods=6)
dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4),  # 6행 4열의 랜덤 숫자로 이루어진 표 생성
                  index = dates,  # index 지정
                  columns =['A','B','C','D'])  # columns 지정
df

                   A         B         C         D
2023-01-01 -0.461848  0.487692 -0.356289  1.209694
2023-01-02 -2.550218  0.490298  0.411841 -0.910457
2023-01-03  0.054357 -0.682519 -1.278948  1.261325
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687
2023-01-05  0.786082 -1.473031 -0.505639  0.168087
2023-01-06  0.321766  0.616693  2.006768  0.665689

In [5]:
df.head()

                   A         B         C         D
2023-01-01 -0.461848  0.487692 -0.356289  1.209694
2023-01-02 -2.550218  0.490298  0.411841 -0.910457
2023-01-03  0.054357 -0.682519 -1.278948  1.261325
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687
2023-01-05  0.786082 -1.473031 -0.505639  0.168087

In [6]:
df.index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2023-01-01 to 2023-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [9]:
df['A']

2023-01-01   -0.461848
2023-01-02   -2.550218
2023-01-03    0.054357
2023-01-04   -0.595415
2023-01-05    0.786082
2023-01-06    0.321766
Freq: D, Name: A, dtype: float64

In [10]:
df[0:3]

                   A         B         C         D
2023-01-01 -0.461848  0.487692 -0.356289  1.209694
2023-01-02 -2.550218  0.490298  0.411841 -0.910457
2023-01-03  0.054357 -0.682519 -1.278948  1.261325

In [11]:
df['20230102':'20230104']

                   A         B         C         D
2023-01-02 -2.550218  0.490298  0.411841 -0.910457
2023-01-03  0.054357 -0.682519 -1.278948  1.261325
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687

In [12]:
df.loc[:, ['A','B']] # 모든 행의 A,B 열 데이터 출력

                   A         B
2023-01-01 -0.461848  0.487692
2023-01-02 -2.550218  0.490298
2023-01-03  0.054357 -0.682519
2023-01-04 -0.595415  0.025189
2023-01-05  0.786082 -1.473031
2023-01-06  0.321766  0.616693

In [13]:
df.loc['20230102':'20230104', ['A','B']]

                   A         B
2023-01-02 -2.550218  0.490298
2023-01-03  0.054357 -0.682519
2023-01-04 -0.595415  0.025189

In [14]:
df.loc['20230103', ['A','B']]

A    0.054357
B   -0.682519
Name: 2023-01-03 00:00:00, dtype: float64

In [15]:
df.iloc[3]

A   -0.595415
B    0.025189
C   -0.692161
D   -0.833687
Name: 2023-01-04 00:00:00, dtype: float64

In [16]:
df.iloc[3:5, 0:4] # 3,4번행의 0,1,2,3번 칼럼 출력

                   A         B         C         D
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687
2023-01-05  0.786082 -1.473031 -0.505639  0.168087

In [17]:
df['E'] = ['one','two','three','four','five','six']
df

                   A         B         C         D      E
2023-01-01 -0.461848  0.487692 -0.356289  1.209694    one
2023-01-02 -2.550218  0.490298  0.411841 -0.910457    two
2023-01-03  0.054357 -0.682519 -1.278948  1.261325  three
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687   four
2023-01-05  0.786082 -1.473031 -0.505639  0.168087   five
2023-01-06  0.321766  0.616693  2.006768  0.665689    six

In [18]:
df[df['E'].isin(['two','four'])] # E 칼럼에 two와 four가 포함된것만 출력

                   A         B         C         D     E
2023-01-02 -2.550218  0.490298  0.411841 -0.910457   two
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687  four

In [19]:
del df['E']
df

                   A         B         C         D
2023-01-01 -0.461848  0.487692 -0.356289  1.209694
2023-01-02 -2.550218  0.490298  0.411841 -0.910457
2023-01-03  0.054357 -0.682519 -1.278948  1.261325
2023-01-04 -0.595415  0.025189 -0.692161 -0.833687
2023-01-05  0.786082 -1.473031 -0.505639  0.168087
2023-01-06  0.321766  0.616693  2.006768  0.665689